Wendellee/2024-Electronics-Competition/module_doc/MAX262_V1.1模块资料/MAX262_V1.1模块资料/参考测试程序/STM32F1控制程序/MAX262_STM32_LCD_PWM波/User/SPFD5408.c
//-----------------------------------------------------------------
// 程序描述:
//      基于FSMC驱动SPFD5408内核的2.8寸液晶屏驱动子程序
// 作    者: 凌智电子
// 开始日期: 2014-01-24
// 完成日期: 2014-01-26
// 修改日期: 2014-03-12
// 当前版本: V1.0.2
// 历史版本: 
// - V1.0.0: (2014-02-07)基本液晶显示：中英文，点线面，图片显示
// - V1.0.1: (2014-02-15)模拟IO和集成FSMC驱动分开
// - V1.0.2: (2014-02-16)头文件中不包含其他头文件
//					 (2014-03-12)把SPFD5408_RS_Set改成	SPFD5408_WR_Start();
// 调试工具: 凌智STM32核心开发板、2.8寸液晶屏、LZE_ST_LINK2
// 说    明:
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <stm32f10x.h>
#include "16x8.h"	
#include "GB1616.h"		 
#include "GB2424.h"
#include "Delay.h"
#include "SPFD5408.h"	

//-----------------------------------------------------------------
// 初始化程序区
//-----------------------------------------------------------------
//-----------------------------------------------------------------
// void GPIO_SPFD5408_Configuration(void)
//-----------------------------------------------------------------
//
// 函数功能: 液晶引脚配置函数
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: RCC_APB2PeriphClockCmd(); GPIO_Init();
// 注意事项: 用GPIO驱动方式和FSMC驱动方式下的引脚配置不一样
//			
//-----------------------------------------------------------------
void GPIO_SPFD5408_Configuration(void)
{ 
	GPIO_InitTypeDef GPIO_InitStructure;

	// 使能IO口时钟
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOD | 
													RCC_APB2Periph_GPIOE, ENABLE);  
	// 部分数据线、部分控制线配置
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 	| GPIO_Pin_1 	|	// D2,D3 
																GPIO_Pin_4 	| GPIO_Pin_5 	| // RD,WR
																GPIO_Pin_7 	| GPIO_Pin_8 	| // CS,D13
																GPIO_Pin_9 	| GPIO_Pin_10 | // D14,D15
																GPIO_Pin_11 | GPIO_Pin_14 | // RS,D0
																GPIO_Pin_15;								// D1
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	// 推挽复用输出
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;						 
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	// 部分数据线配置
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 	| GPIO_Pin_8 	|	// D4,D5
																GPIO_Pin_9 	| GPIO_Pin_10 | // D6,D7
																GPIO_Pin_11 | GPIO_Pin_12 | // D8,D9
																GPIO_Pin_13 | GPIO_Pin_14 | // D10,D11
																GPIO_Pin_15;								// D12
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;						// 推挽复用输出
	GPIO_Init(GPIOE, &GPIO_InitStructure); 
  // 液晶复位，背光灯引脚配置
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13;	// RST,LED
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;					// 推挽输出
	GPIO_Init(GPIOD, &GPIO_InitStructure);

	SPFD5408_LED_OFF;            															// LED关
}  
//-----------------------------------------------------------------
// void STM32_FSMC_Init(void)
//-----------------------------------------------------------------
//
// 函数功能: 配置FSMC
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void STM32_FSMC_Init(void)
{
  FSMC_NORSRAMInitTypeDef  FSMC_NORSRAMInitStructure;
  FSMC_NORSRAMTimingInitTypeDef  p;
	// 打开FSMC时钟
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_FSMC, ENABLE);	
	// 打开复用功能时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);	

  // FSMC_Bank1_NORSRAM1 时间配置
  // 地址建立时间期限   
	p.FSMC_AddressSetupTime = 0x02;											                                        
	// 地址的持续时间 
	p.FSMC_AddressHoldTime = 0x00;											
	// 设定数据时间期限
	p.FSMC_DataSetupTime = 0x05;												
 	// 总线转向时间
	p.FSMC_BusTurnAroundDuration = 0x00;							
	// CLK时钟输出信号的HCLK周期数表示时间
  p.FSMC_CLKDivision = 0x00;			
	// 指定在获得第一个数据前的时钟周期
  p.FSMC_DataLatency = 0x00;			
  p.FSMC_AccessMode = FSMC_AccessMode_B;
	// 指定的FSMC块
  FSMC_NORSRAMInitStructure.FSMC_Bank = FSMC_Bank1_NORSRAM1;
	// 地址和数据值不复用的数据总线 
  FSMC_NORSRAMInitStructure.FSMC_DataAddressMux = 
									FSMC_DataAddressMux_Disable; 
	// 外部存储器的类型
  FSMC_NORSRAMInitStructure.FSMC_MemoryType = 
														FSMC_MemoryType_NOR;
	// 数据宽度
  FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth = 
														FSMC_MemoryDataWidth_16b;
	// 禁用突发访问模式
  FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode = 
														FSMC_BurstAccessMode_Disable;
	// 指定等待信号的极性
  FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = 
														FSMC_WaitSignalPolarity_Low;
	// disables the Wrapped burst access mode for Flash
	FSMC_NORSRAMInitStructure.FSMC_WrapMode = 
														FSMC_WrapMode_Disable;
  FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive = 
														FSMC_WaitSignalActive_BeforeWaitState;
	// 启用指定的FSMC块的写操作
  FSMC_NORSRAMInitStructure.FSMC_WriteOperation =
														FSMC_WriteOperation_Enable;
  FSMC_NORSRAMInitStructure.FSMC_WaitSignal = 
														FSMC_WaitSignal_Disable;
	// 扩展模式
  FSMC_NORSRAMInitStructure.FSMC_ExtendedMode = 
														FSMC_ExtendedMode_Disable;
	// 禁用写突发操作
  FSMC_NORSRAMInitStructure.FSMC_WriteBurst = 
														FSMC_WriteBurst_Disable;
  FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct = &p;
  FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct = &p;      
  FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure); 
  // 使能 FSMC Bank1_SRAM 
  FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);  
}

//-----------------------------------------------------------------
// void SPFD5408_Init(void)
//-----------------------------------------------------------------
//
// 函数功能: 液晶初始化函数
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: SPFD5408_Delay(), SPFD5408_Write_Data(), 
// 					 SPFD5408_Write_Reg (). SPFD5408_WR_Start().   
// 注意事项: 无
//-----------------------------------------------------------------
void SPFD5408_Init(void)
{	 
	GPIO_SPFD5408_Configuration();						// IO配置
	STM32_FSMC_Init();												// FSMC初始化
	SPFD5408_RST_Set;													// 下降沿复位	
	SPFD5408_Delay(10);
	SPFD5408_RST_Clr;								 	   	
	SPFD5408_Delay(10);
	SPFD5408_RST_Set;								 	 
	SPFD5408_Delay(10); 
	
	SPFD5408_Write_Data(0xffff);							// 数据线全高
	SPFD5408_Write_Reg(0x0000,0x0001);   			// 停止内部晶体振荡器 
	SPFD5408_Write_Reg(0x0001,0x0100);   			// 输出驱动控制

#if ID_AM==000    
	SPFD5408_Write_Reg(0x0003,0x1000);				// 横屏显示：水平、垂直递减 
#elif ID_AM==001
	SPFD5408_Write_Reg(0x0003,0x1008);				// 竖屏显示：水平、垂直递减  
#elif ID_AM==010
	SPFD5408_Write_Reg(0x0003,0x1010);				// 横屏显示：水平递增、垂直递减
#elif ID_AM==011 
	SPFD5408_Write_Reg(0x0003,0x1018);				// 竖屏显示：水平递增、垂直递减
#elif ID_AM==100
	SPFD5408_Write_Reg(0x0003,0x1020);				// 横屏显示：水平递减、垂直递增
#elif ID_AM==101
	SPFD5408_Write_Reg(0x0003,0x1028);				// 竖屏显示：水平递减、垂直递增 
#elif ID_AM==110
	SPFD5408_Write_Reg(0x0003,0x1030);				// 横屏显示：水平、垂直递增
#elif ID_AM==111
	SPFD5408_Write_Reg(0x0003,0x1038);				// 竖屏显示：水平、垂直递增
#endif
//																					// D3.AM选择垂直(1)/水平扫描(0)   
//												    							// D5(ID1):D4(ID0):控制计数器增减方向
	SPFD5408_Write_Reg(0x0004,0x0000);   			// 重新定位显示尺寸控制寄存器
	SPFD5408_Write_Reg(0x0008,0x0207);   			// 显示控制2 	
	SPFD5408_Write_Reg(0x0009,0x0000);   
	SPFD5408_Write_Reg(0x000a,0x0000);   			 	
	SPFD5408_Write_Reg(0x000C,0x0000);   			// RGB显示接口控制
	SPFD5408_Write_Reg(0x000D,0x0000);   
	SPFD5408_Write_Reg(0x000F,0x0000);   			 	
	SPFD5408_Write_Reg(0x0007,0x0101);
	// 电源控制   
	SPFD5408_Write_Reg(0x0010,0x12b0);   
	SPFD5408_Write_Reg(0x0011,0x0007);   
	SPFD5408_Write_Reg(0x0017,0x0001);   
   					 	
	SPFD5408_Write_Reg(0x0012,0x01bb);   
	SPFD5408_Write_Reg(0x0013,0x1c00);   
	SPFD5408_Delay(50);   						 	
	SPFD5408_Write_Reg(0x0029,0x0019);				     
	SPFD5408_Delay(50);   						 	
	SPFD5408_Write_Reg(0x0030,0x0102);   
	SPFD5408_Delay(50);
	   
	// GAMMA控制						 	
	SPFD5408_Write_Reg(0x0031,0x0c21);				     
	SPFD5408_Write_Reg(0x0032,0x0b22);			   	
	SPFD5408_Write_Reg(0x0033,0x2610);				  	
	SPFD5408_Write_Reg(0x0034,0x1e0b);				    
	SPFD5408_Write_Reg(0x0035,0x0a04);   
	SPFD5408_Write_Reg(0x0036,0x1701);   
	SPFD5408_Write_Reg(0x0037,0x0617);   
	SPFD5408_Write_Reg(0x0038,0x0305);   
	SPFD5408_Write_Reg(0x0039,0x0a05);   			 	
	SPFD5408_Write_Reg(0x003a,0x0c04);			
	SPFD5408_Write_Reg(0x003b,0x0c00);			    
	SPFD5408_Write_Reg(0x003c,0x000c); 			  
	SPFD5408_Write_Reg(0x003d,0x050c);				
	SPFD5408_Write_Reg(0x003e,0x0204);    
	SPFD5408_Write_Reg(0x003f,0x0404); 
	
	// 显示尺寸设置  
	SPFD5408_Write_Reg(0x0050,0x0000); 				// HSA7~HSA0  
	SPFD5408_Write_Reg(0x0051,239);   	    	// HEA7~HEA0
	SPFD5408_Write_Reg(0x0052,0x0000);     		// VSA8~VSA0
	SPFD5408_Write_Reg(0x0053,319); 					// VEA8~VEA0
	 
