Wendellee/2024-Electronics-Competition/module_doc/MAX262_V1.1模块资料/MAX262_V1.1模块资料/参考测试程序/STM32F1控制程序/MAX262_STM32_LCD_PWM波/User/SPFD5408.c
	// 门扫描控制 			 	
	SPFD5408_Write_Reg(0x0060,0x2700);		 		  
	SPFD5408_Write_Reg(0x0061,0x0001);     		 
	SPFD5408_Write_Reg(0x006A,0x0000);   			 	
	
	SPFD5408_Write_Reg(0x0080,0x0000);   			// 部分图像1显示位置
	SPFD5408_Write_Reg(0x0081,0x0000);   			// 部分图像1RAM起始地址
	SPFD5408_Write_Reg(0x0082,0x0000);   			// 部分图像1RAM终止地址
	SPFD5408_Write_Reg(0x0083,0x0000);   			// 部分图像2显示位置
	SPFD5408_Write_Reg(0x0084,0x0000);   			// 部分图像2RAM起始地址
	SPFD5408_Write_Reg(0x0085,0x0000);   			// 部分图像2RAM终止地址
												
	// 屏幕接口控制1					
	SPFD5408_Write_Reg(0x0090,0x0010);   
	SPFD5408_Write_Reg(0x0092,0x0000);   
	SPFD5408_Write_Reg(0x0093,0x0103);   
	SPFD5408_Write_Reg(0x0095,0x0210);   
	SPFD5408_Write_Reg(0x0097,0x0000);   
	SPFD5408_Write_Reg(0x0098,0x0000);   
	SPFD5408_Write_Reg(0x00f0,0x5408);   
	SPFD5408_Write_Reg(0x00f3,0x0005);   
	SPFD5408_Write_Reg(0x00f4,0x001f);   
	SPFD5408_Write_Reg(0x00f0,0x0000);   
	SPFD5408_Write_Reg(0x0007,0x0173);  
	SPFD5408_LED_ON;  												//  打开背光灯
	SPFD5408_WR_Start();
}
//-----------------------------------------------------------------
// SPFD5408驱动区
//-----------------------------------------------------------------
//-----------------------------------------------------------------
// void SPFD5408_Write_Data(u16 Digital)
//-----------------------------------------------------------------
//
// 函数功能: SPFD5408写数据
// 入口参数: 要写入的参数
// 返回参数: 无
// 全局变量: 无
// 调用模块: 无   
// 注意事项: 无
//					 
//-----------------------------------------------------------------
void SPFD5408_Write_Data(u16 Digital)
{
	*(volatile uint16_t *) (LCD_Data_Addr)= Digital; 
}
//-----------------------------------------------------------------
// u16 SPFD5408_Read_Data(void)
//-----------------------------------------------------------------
//
// 函数功能: SPFD5408读数据
// 入口参数: 要读出的参数
// 返回参数: 无
// 全局变量: 无
// 调用模块: 无   
// 注意事项: 为了兼容FSMC与GPIO两种驱动液晶，故设计普通IO口为FSMC
//					 所占用的引脚，即GPIO在数据传送时须要对IO状态重新组合和分配
//-----------------------------------------------------------------
u16 SPFD5408_Read_Data(void)
{
	u16 ReadValue=0;
	
	ReadValue = (*(volatile uint16_t *) (LCD_Data_Addr)); 

	return (ReadValue);
}

//-----------------------------------------------------------------
// void SPFD5408_Write_Reg(u16 RegIndex, u16 RegValue)
//-----------------------------------------------------------------
//
// 函数功能: 配置SPFD5408寄存器的函数
// 入口参数: RegIndex:寄存器地址
//				   RegValue:寄存器数据
// 返回参数: 无
// 全局变量: 无
// 调用模块: SPFD5408_Write_Data().   
// 注意事项:
//-----------------------------------------------------------------
void SPFD5408_Write_Reg(u16 RegIndex, u16 RegValue)
{
	*(volatile uint16_t *) (LCD_Reg_Addr) = RegIndex;
	*(volatile uint16_t *) (LCD_Data_Addr) = RegValue;
}

//-----------------------------------------------------------------
// void SPFD5408_Set_Cursor(u16 x,u16 y)
//-----------------------------------------------------------------
//
// 函数功能: 设置当前坐标
// 入口参数: X:X坐标
//				   Y:Y坐标
// 返回参数: 无
// 全局变量: 无
// 调用模块: SPFD5408_Write_Reg ().   
// 注意事项:
//-----------------------------------------------------------------
void SPFD5408_Set_Cursor(u16 x,u16 y)
{
	SPFD5408_Write_Reg(GRAM_X,x);
	SPFD5408_Write_Reg(GRAM_Y,y);
}

//-----------------------------------------------------------------
// void SPFD5408_WR_Start(void)
//-----------------------------------------------------------------
//
// 函数功能: 写GRAM
// 入口参数: 无
// 返回参数: 无
// 全局变量: GRAM_WR.
// 调用模块: SPFD5408_Write_Data ().   
// 注意事项:
//-----------------------------------------------------------------
void SPFD5408_WR_Start(void)
{
	*(volatile uint16_t *) (LCD_Reg_Addr)= GRAM_WR;
}

//-----------------------------------------------------------------
// void SPFD5408_Write_Pixel(u16 x,u16 y, u16 Color)
//-----------------------------------------------------------------
//
// 函数功能: 设置液晶上一个点的颜色
// 入口参数: X:X坐标, Y:Y坐标, Color:颜色值
// 返回参数: 无
// 全局变量: 无
// 调用模块: SPFD5408_Set_Cursor(), SPFD5408_WR_Start(),
//					 SPFD5408_Write_Data().
// 注意事项: 无
//-----------------------------------------------------------------
void SPFD5408_Write_Pixel(u16 x,u16 y, u16 Color)
{
	LCD_SetPoint(x,y,Color);
}

//-----------------------------------------------------------------
// u16 SPFD5408_Read_Pixel(u16 x,u16 y)
//-----------------------------------------------------------------
//
// 函数功能: 读取液晶上一个点的颜色
// 入口参数: X:X坐标, Y:Y坐标 
// 返回参数: 原色值
// 全局变量: 无
// 调用模块: SPFD5408_Set_Cursor(),  SPFD5408_BGR2RGB().  
// 注意事项: 无
//-----------------------------------------------------------------
u16 SPFD5408_Read_Pixel(u16 x,u16 y)
{
	SPFD5408_Set_Cursor(x,y);									// 设置坐标
//	SPFD5408_WR_Start();       								// 选择GRAM地址 		
	
	return (SPFD5408_BGR2RGB(SPFD5408_Read_Data()));
}

//-----------------------------------------------------------------
// u16 SPFD5408_BGR2RGB(u16 c)
//-----------------------------------------------------------------
//
// 函数功能: RRRRRGGGGGGBBBBB 改为 BBBBBGGGGGGRRRRR 格式
// 入口参数: c:GBR格式的颜色值
// 返回参数: RGB格式的颜色值
// 全局变量: 无
// 调用模块: 无   
// 注意事项: 从SPFD读出的数据为GBR格式, 而我们写入的时候为RGB格式 
// 					 通过该函数转换.
//-----------------------------------------------------------------
u16 SPFD5408_BGR2RGB(u16 c)
{
	u16  r, g, b, rgb; 
	
	b = (c >> 0) & 0x1f;
	g = (c >> 5) & 0x3f;
	r = (c >> 11) & 0x1f;	 
	rgb = (b << 11) + (g << 5) + (r << 0);
		 
	return(rgb);
} 

//-----------------------------------------------------------------
// void SPFD5408_Set_Window(u16 X_Size,u16 Y_Size)
//-----------------------------------------------------------------
//
// 函数功能: 设置窗口大小
// 入口参数: X_Size: x轴长度,  Y_Size: y轴长度.
// 返回参数: 无
// 全局变量: 无
// 调用模块: SPFD5408_Write_Reg (), 	SPFD5408_Set_Cursor();	.   
// 注意事项:
//-----------------------------------------------------------------
void SPFD5408_Set_Window(u16 X_Size,u16 Y_Size)
{
	SPFD5408_Write_Reg (WINDOW_XADDR_START, XSTART);
	SPFD5408_Write_Reg (WINDOW_XADDR_END, X_Size-1);	
	SPFD5408_Write_Reg (WINDOW_YADDR_START, YSTART);	
	SPFD5408_Write_Reg (WINDOW_YADDR_END, Y_Size-1);	
	SPFD5408_Set_Cursor (XSTART, YSTART);	
} 

//-----------------------------------------------------------------
// void SPFD5408_Clear_Window(u16 Color)
//-----------------------------------------------------------------
//
// 函数功能: 清屏函数
// 入口参数: Color:颜色值
// 返回参数: 无
// 全局变量: 无
// 调用模块: SPFD5408_Set_Cursor (), SPFD5408_Set_Window(), 
// 					 SPFD5408_Write_Data().   
// 注意事项:
//-----------------------------------------------------------------
void SPFD5408_Clear_Window(u16 Color)
{
	u32 Point = 0;

