Wendellee/2024-Electronics-Competition/module_doc/MAX262_V1.1模块资料/MAX262_V1.1模块资料/参考测试程序/STM32F1控制程序/MAX262_STM32_LCD_PWM波/User/SPFD5408.c
	SPFD5408_Set_Window (XSIZE, YSIZE);  			// 设置窗口	 
	SPFD5408_WR_Start();											// 写GRAM
	for (Point = XSTART*YSTART; Point < XSIZE*YSIZE; Point ++)	
		SPFD5408_Write_Data (Color);						// 画点
	SPFD5408_CS_Set; 
}

//-----------------------------------------------------------------
// void SPFD5408_Fill(u16 x0,u16 y0,u16 x1,u16 y1,u16 Color)
//-----------------------------------------------------------------
//
// 函数功能: 给某一区域填充某一种颜色
// 入口参数: x0, y0: 起始坐标. x1, y1: 终点坐标. Color:颜色值
// 返回参数: 无
// 全局变量: 无
// 调用模块: SPFD5408_Set_Cursor(), SPFD5408_Write_Reg(), 
// 					 SPFD5408_Write_Data().   
// 注意事项:
//-----------------------------------------------------------------
void SPFD5408_Fill(u16 x0,u16 y0,u16 x1,u16 y1,u16 Color)
{
	u16 x,y;
	
// 设置起始点
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)
	SPFD5408_Set_Cursor (x0, y0);
#else
	SPFD5408_Set_Cursor (x1, y0);
#endif 
	SPFD5408_Write_Reg(WINDOW_XADDR_START,x0);
	SPFD5408_Write_Reg(WINDOW_XADDR_END,x1);	
	SPFD5408_Write_Reg(WINDOW_YADDR_START,y0);	
	SPFD5408_Write_Reg(WINDOW_YADDR_END,y1);	
	SPFD5408_WR_Start();
	SPFD5408_RS_Set;
	for (x = x0; x <= x1; x ++)	  				
		for (y = y0; y <= y1; y ++)
			SPFD5408_Write_Data (Color);	
	SPFD5408_CS_Set; 
}

//-----------------------------------------------------------------
//字符(串)显示区域
//-----------------------------------------------------------------
//-----------------------------------------------------------------
//	 void GetASCIICode(
//		u8* pBuffer,													// 显示缓冲CharBuffer[] 
//		u8 ASCII															// 输入的ASCII码, 如'A'
//	)
//-----------------------------------------------------------------
//
// 函数功能: 取ASCII码子程序
// 入口参数: * pBuffer:显示缓冲CharBuffer[], 
//               ASCII: 输入的ASCII码, 如'A'.
// 返回参数: 无 
// 全局变量: 无
// 调用模块: 无   
// 注意事项: 输入一个ASCII码，取得它在font16x8中的16Byte显示代码
//				   并将其存放到一个16byte的ASCII显示缓冲CharBuffer[]中.
//-----------------------------------------------------------------
void GetASCIICode(
	u8* pBuffer,															// 显示缓冲CharBuffer[] 
	u8 ASCII																	// 输入的ASCII码, 如'A'
)
{  
	u8 i;
	
	for (i = 0; i < 16; i ++)
	{	
		*(pBuffer + i) = font16x8[(ASCII - 32) * 16 + i];
	}
}

//-----------------------------------------------------------------
//	void GetChineseCode(
//		u8* pBuffer,													// 汉字字模缓冲 
//		u8 Chi[2]															// 要查找的汉字
//	)
//-----------------------------------------------------------------
//
// 函数功能: 取16x16中文字模子程序
// 入口参数: * pBuffer: 汉字字模指针. Chi[2]: 要查找字模的汉字.
// 返回参数: 无
// 全局变量: codeGB_16: 字模数组.
// 调用模块: 无   
// 注意事项: 输入一个中文，取得它在codeGB_16数组中的字模,
//					 并将其存放到一个32byte的显示缓冲ChineseBuffer[].
//-----------------------------------------------------------------
void GetChineseCode(
	u8* pBuffer,															// 汉字字模缓冲
	u8 Chi[2]																	// 要查找的汉字
)
{	
	u8 k, i;
	// 最多查找100 个汉字, 多于100 个无法查找. 
	// 也可以修改k 的最大值进行增加查找范围.
	for (k = 0; k < 100; k ++)								
	{																																			
		if ((codeGB_16[k].Index[0] == Chi[0]) && (codeGB_16[k].Index[1] == Chi[1]))
		{																				// 对比输入的汉字和数组中的汉字是否一致,  					
			for(i=0;i<32;i++)											// 若一致则取出字模数据.
			{
				*(pBuffer+i) = codeGB_16[k].Msk[i] ;// 读取字模数据
			}
			return ;													
		}
}
	for(i = 0; i < 32; i ++)
	{	// 若字库中没有要查找的汉字, 全部清理. 即显示背景色,
		// 其效果相当于没显示, 跳过此汉字.
		*(pBuffer + i) = 0x00 ;									
	}
}

//-----------------------------------------------------------------
//	void GetChineseCode24x24(
//		u8* pBuffer,													// 显示缓冲
//		u8 Chi[2]															// 要查找的数据
//	)
//-----------------------------------------------------------------
//
// 函数功能: 取24x24中文字模子程序
// 入口参数: * pBuffer:  读取的字模缓冲, Chi[2]: 要查找的汉字.
// 返回参数: 无
// 全局变量: codeGB_24x24: 字模数组
// 调用模块: 无   
// 注意事项: 输入一个中文，取得它在codeGB_24x24数组中的字模数据
//				 并将其存放到一个32byte的显示缓冲ChineseBuffer[]
//-----------------------------------------------------------------
void GetChineseCode24x24(
	u8* pBuffer,															// 显示缓冲 
	u8 Chi[2]																	// 要查找的数据
)
{	
	u8 k, i;
	// 最多查找100 个汉字, 多于100 个无法查找. 
	// 也可以修改k 的最大值进行增加查找范围.
	for (k = 0; k < 100; k ++)									
	{	// 对比输入的汉字和数组中的汉字是否一致, 若一致则取出字模数据.   
		if ((codeGB_24x24[k].Index[0] == Chi[0]) && 
				(codeGB_24x24[k].Index[1] == Chi[1]))	
		{
			for(i = 0; i < 72; i ++)
			{	// 读取字模数据
				*(pBuffer+i) = codeGB_24x24[k].Msk[i] ;
			}
			return ;																
		}
	}
	for(i = 0; i < 72; i ++)
	{	// 若字库中没有要查找的汉字, 全部清理. 即显示背景色,
		// 其效果相当于没显示, 跳过此汉字.
		*(pBuffer + i) = 0x00 ;										
	}
}

//-----------------------------------------------------------------
//	void LCD_WriteASCII(
//		u8 x,
//		u16  y,
//		u16 CharColor,
//		u16 CharBackColor,
//		u8 ASCIICode
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD写1个ASCII字符函数
// 入口参数: x: 横向坐标, 由左到右分别是0~239.  
//					 y: 纵向坐标, 由上到下分别为0~319.
//           color: 指定LCD全屏颜色 RGB(5-6-5).
//					 CharColaor: 字符的颜色. 
//				 	 CharBackColor: 字符背景颜色. 		
//					 ASCIICode: 相应字符的ASCII码.
// 返回参数: 无
// 全局变量: 无 
// 调用模块: LCD_SetBox(), SPFD5408_WR_Start(), GetASCIICode().    
// 注意事项: 如果单独使用此函数则应该加上LCD_Rs_H()	
//					 和SPFD5408_CS_Set;为了优化系统省去了这个指令
//				   假设此函数执行的上一条语句是写命令，（RS_L情况）
//				   则写入将出错，因为ILI9320认为当RS_L时写入的是命令
//-----------------------------------------------------------------
void LCD_WriteASCII(
	u8  x,																		// X轴坐标	
	u16 y,																		// y轴坐标
	u16 CharColor,														// 字体颜色
	u16 CharBackColor,												// 背景颜色
	u8 ASCIICode															// ADCII码
)
{
	u8 RowCounter,BitCounter;
	u8 *ASCIIPointer;
	u8 ASCIIBuffer[16];
  // 判断横屏还是竖屏,
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	
	LCD_SetBox (x, y, x + 8, y + 16);    			// 设置窗口大小
#else
	LCD_SetBox(x , y, x + 16, y + 8);    
#endif 
	// 启动写数据函数, 每次写数据前先调用此函数       
	SPFD5408_WR_Start();	
	// 取这个字符的显示代码										
	GetASCIICode(ASCIIBuffer,ASCIICode);			
	ASCIIPointer=ASCIIBuffer;
  // 一个ASCII字模有16个8Bit数据组成
	for (RowCounter=0; RowCounter<16; RowCounter++)	
	{ // 扫描一个8bit字模数据的每一位
		for (BitCounter=0; BitCounter<8; BitCounter++)
		{ // 判断字模数据为'0'还是为'1'.为'0'写入背景颜色,为'1'写入字体颜色
			if ((*ASCIIPointer&(0x80 >> BitCounter)) == 0x00) 
			{
				SPFD5408_Write_Data(CharBackColor);	// 写入背景颜色数据
			}
			else
			{
				SPFD5408_Write_Data(CharColor);			// 写入字体颜色数据
			}
		}
		ASCIIPointer++;													// 指向下一个字模数据
	}
  SPFD5408_CS_Set;	  											
} 

//-----------------------------------------------------------------
//	void LCD_WriteASCIIString(
//	   u8  x,
//	   u16 y,
//	   u16 CharColor,
//	   u16 CharBackColor,
//	   u8 *s
//	)
//-----------------------------------------------------------------
//
// 函数功能: 向指定位置写入一个或多个字符，本函数带自动换行功能
// 入口参数: x: 横向坐标, 由左到右分别是0~239. 
//					 y: 纵向坐标, 由上到下分别为0~319.
//	         CharColaor: 字符的颜色. CharBackColor: 字符背景颜色.
//	         *s: 指向要写的字符串.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_WriteASCII().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_WriteASCIIString(
   u8 x,
   u16  y,
   u16 CharColor,
   u16 CharBackColor,
   u8 *s
)
{
  u8 databuff;
	
  SPFD5408_RS_Set;
  do
  {
    databuff = *s ++;  
    LCD_WriteASCII (x, y, CharColor, CharBackColor, databuff);    
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)  
    if (x < 232)
      x += 8;
    else if (y < 304)
    {
      x = 0;
      y += 16;
    }   
    else
    {
      x = 0;
      y = 0;
    }
       
#else
    if (y<312)
      y += 8;
    else if (x < 224)
    {
      y = 0;
      x += 16;
    }
    else
    {
      x = 0;
      y = 0;
    }
#endif 
  }
  while (*s!=0);
  SPFD5408_CS_Set;
}

//-----------------------------------------------------------------
// void LCD_WriteChinese(
//		u8 x,
//		u16  y,
//		u16 CharColor,
//		u16 CharBackColor,
//		u8 *sp
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD写1个中文函数
// 入口参数: x: 横向坐标, 由左到右分别是0~239.
//					 y: 纵向坐标, 由上到下分别为0~319.
//				  CharColor: 字符的颜色. 		
//					CharBackColor: 字符背景颜色.
//          *sp: 相应中文的编码.
// 返回参数: 无
// 全局变量: 无
// 调用模块:  LCD_SetBox(), SPFD5408_WR_Start(), GetChineseCode(), 
//						SPFD5408_Write_Data().   
// 注意事项: 320*240分辨率的显示屏，横向能显示15中文字符，竖向能显示20行.
//				   如果单独使用此函数则应该加上LCD_Rs_H()和SPFD5408_CS_Set;
// 					 为了优化系统省去了这个指令,
//				  假设此函数执行的上一条语句是写命令, (RS_L情况)则写入将出错, 
//				  因为SPFD5408认为当RS_L时写入的是命令
//-----------------------------------------------------------------
void LCD_WriteChinese(
		u8 x,																		// x坐标
		u16  y,																	// y坐标
		u16 CharColor,													// 字体颜色
		u16 CharBackColor,											// 背景颜色
		u8 *sp																	// 指向汉字字符的指针
	)
{
  u8 ByteCounter,BitCounter;
  u8 *ChinesePointer;
  u8 ChineseBuffer[32];											// 汉字字模缓存
	// 判断屏幕方向	  
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	
	LCD_SetBox (x, y, x + 16, y + 16);    		// 设置窗口大小
#else
	LCD_SetBox (x, y, x + 16, y + 16);    
#endif 
  SPFD5408_WR_Start();											// 启动写数据
  GetChineseCode(ChineseBuffer, sp);				// 得到中文字符编码
  ChinesePointer=ChineseBuffer;
  // 16x16字体包括32个8bit数据      
  for(ByteCounter=0; ByteCounter<32; ByteCounter++)	
  { // 扫描8bit字模数据的每一bit																
    for(BitCounter=0;BitCounter<8;BitCounter++)	
    { // 某一位为‘0’
      if((*ChinesePointer & (0x80 >> BitCounter)) == 0x00)
      {
        SPFD5408_Write_Data(CharBackColor);	// 写入背景颜色
      }
      else																	// 某一位为‘1’
      {
        SPFD5408_Write_Data(CharColor); 		// 写入字体颜色
      }
    }
    ChinesePointer++;												// 指向下一字模数据
  }
  SPFD5408_CS_Set;	  											
}	

//-----------------------------------------------------------------
//	void LCD_WriteChineseString(
//		u8 x, 
//		u16 y, 
//		u16 CharColor, 
//		u16 CharBackColor, 
//		u8 *sp 
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD写中文字符串函数
// 入口参数: x: 横向坐标, 由左到右分别是0~239. 
//					 y: 纵向坐标, 由上到下分别为0~319.
//				 	 CharColor: 字符的颜色. CharBackColor: 字符背景颜色 .
//         	 *sp: 相应中文的编码.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_WriteChinese().   
// 注意事项: 无
//-----------------------------------------------------------------
void LCD_WriteChineseString(
		u8 x, 
		u16 y, 
		u16 CharColor, 
		u16 CharBackColor, 
		u8 *sp 
	)
{
	u8 * pt;

	pt = sp;
	while (*pt)
	{
	 	LCD_WriteChinese(x, y, CharColor, CharBackColor, pt);
		if (*pt == ' ')
		{
			pt += 1 ;
		}
		else
		{
			pt += 2 ;
		}
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)  
    if (x<224)
    {
      x += 16;
    } 
    else if (y < 304)
    {
      x = 0;
      y += 16;
    }   
    else
    {
      x = 0;
      y = 0;
    }     
#else
    if (y < 304)
    {
      y += 16;
    }
    else if (x < 224)
    {
      y = 0;
      x += 16;
    }
    else
    {
      x = 0;
      y = 0;
    }
#endif
	}
}

//-----------------------------------------------------------------
//	void LCD_WriteString(
//		u8 x, 
//		u16  y, 
//		u16 CharColor, 
//		u16 CharBackColor, 
//		u8 *s 
//	) 
//-----------------------------------------------------------------
//
// 函数功能: LCD写字符串函数, 可以英文字符和汉字字符混合写.
// 入口参数: x: 横向坐标, 由左到右分别是0~239.  
//					 y: 纵向坐标, 由上到下分别为0~319
//				 CharColor: 字符的颜色. 
//				CharBackColor: 字符背景颜色.
//         *s: 相应字符的编码.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_WriteASCII(),  LCD_WriteChinese().  
// 注意事项:
//-----------------------------------------------------------------
void LCD_WriteString(
		u8 x, 																	// X轴坐标
		u16  y, 																// y轴坐标
		u16 CharColor, 													// 字体颜色
		u16 CharBackColor, 											// 背景颜色
		u8 *s 																	// 指向字符串的字符指针
	)
{
	u8 * pt;
	u8 tem;

	pt = s;
	while (*pt)
	{	// 要显示的字符为英文字符16X8
		if (*pt < 128)													
		{
			tem = *pt;
			// 调用显示ASCII码函数
			LCD_WriteASCII (x, y, CharColor, CharBackColor, tem);	
			pt += 1 ;
			// 判断屏幕方向, 水平方向为X轴方向
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)  		
			// 显示坐标小于231, 向后移8 个像素点, 显示下一个字符
			if (x < 231)													
			{
				x += 8;
			} 
			else if (y < 303)		// 一行写满,水平方向从0 开始,竖直方向增加16个像素点									
			{
				x = 0;
				y += 16;
			}   
			else								// 水平方向和竖直方向都写满, 继续从(0, 0)开始显示																
			{
				x = 0;
				y = 0;
			}
			
#else											// 水平方向为y轴方向
			if (y<311)					// 水平方向坐标小于311, 像素点加8, 继续显示下一个字符
			{
				y += 8;
			}
			else if (x < 223)		// 如果竖直方向没写满, 水平方向从0开始显示, 竖直方向增加16个像素点
			{
				y = 0;
				x += 16;
			}
			else								// 水平方向和竖直方向都写满, 从(0, 0)开始显示
			{
				x = 0;
				y = 0;
			}
#endif 
		}
		else									// 显示的是中文字符16X16
		{	// 调用显示中文字符函数
		 	LCD_WriteChinese(x, y, CharColor, CharBackColor, pt);	
			pt += 2 ;						// 中文字符占用两个字节, 所以指针偏移加‘2’
			// 水平方向为X轴方向
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)  		
			if (x<223)					// X坐标小于223, X方向增加16个像素点, 显示下一个字符
			{
				x += 16;
			} 
			else if (y < 303)		// y小于303, x方向从0开始, y增加16个像素点, 换行显示
			{
				x = 0;
				y += 16;
			}   
			else								// x方向和y方向都写满, 从(0, 0)开始显示
			{
				x = 0;
				y = 0;
			}     
#else											// 竖直方向为y轴方向
			if (y < 303)				// X坐标小于303, y方向增加16个像素点, 显示下一个字符
			{
				y += 16;
			}
			else if (x < 223)		// y小于223, y方向从0开始, x增加16个像素点, 换行显示
			{
				y = 0;
				x += 16;
			}
			else								// x方向和y方向都写满, 从(0, 0)开始显示
			{
				x = 0;
				y = 0;
			}
#endif
		}
	}
}

//-----------------------------------------------------------------
//	void LCD_WriteChinese24x24(
//		u8 x,
//		u16  y,
//		u16 CharColor,
//		u16 CharBackColor,
//		u8 *sp
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD写1个中文函数(24X24)
// 入口参数: x: 横向坐标, 由左到右分别是0~239. 
// 					 y: 纵向坐标, 由上到下分别为0~319.
//				 CharColor: 字符的颜色, 
//				CharBackColor: 字符背景颜色.
//         	 *sp: 相应中文的编码.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_SetBox(), SPFD5408_WR_Start(), 
//					 GetChineseCode24x24(), SPFD5408_Write_Data().  
// 注意事项:
//-----------------------------------------------------------------
void LCD_WriteChinese24x24(
		u8 x,																		// x轴坐标
		u16  y,																	// y轴坐标
		u16 CharColor,													// 字体颜色
		u16 CharBackColor,											// 背景颜色
		u8 *sp																	// 中文字符指针
	)
{

