Wendellee/2024-Electronics-Competition/module_doc/MAX262_V1.1模块资料/MAX262_V1.1模块资料/参考测试程序/STM32F1控制程序/MAX262_STM32_LCD_PWM波/User/SPFD5408.c
  u8 ByteCounter,BitCounter;
  u8 *ChinesePointer;
  u8 ChineseBuffer24x24[72];								// 24x24字体缓存
	// 检测频幕显示方向	  
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	
	LCD_SetBox (x, y, x + 24, y + 24);    		// 设置窗口
#else
	LCD_SetBox (x, y, x + 24, y + 24);    
#endif 
  SPFD5408_WR_Start();											//	启动写数据
  GetChineseCode24x24(ChineseBuffer24x24, sp);// 得到中文字符编码
  ChinesePointer=ChineseBuffer24x24;
  // 24x24字体包括72个8bit数据 
  for(ByteCounter=0; ByteCounter<72; ByteCounter++)
  { //	字模数据的每一bit																		
    for(BitCounter=0;BitCounter<8;BitCounter++)				
    {																				// 若为‘0’																		
      if((*ChinesePointer & (0x80 >> BitCounter)) == 0x00)	
      {
        SPFD5408_Write_Data(CharBackColor);	// 显示背景颜色
      }
      else																	// 若为‘1’
      {
        SPFD5408_Write_Data(CharColor); 		// 显示字体颜色
      }
    }
    ChinesePointer++;												// 指向下一字模数据
  }
  SPFD5408_CS_Set;	  											// 取消片选
}	

//-----------------------------------------------------------------
//	void LCD_WriteChinese24x24string(
//		u8 x,
//		u16  y,
//		u16 CharColor,
//		u16 CharBackColor,
//		u8 *sp
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD写中字符串函数(24X24)
// 入口参数: x: 横向坐标, 由左到右分别是0~239. 
//					 y: 纵向坐标, 由上到下分别为0~319.
//				 CharColor: 字符的颜色, 
//				CharBackColor: 字符背景颜色.
//         	 *sp: 相应中文的编码.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_WriteChinese24x24().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_WriteChinese24x24string(
		u8 x,
		u16  y,
		u16 CharColor,
		u16 CharBackColor,
		u8 *sp
	)
{
	u8 * pt;

	pt = sp;
	while (*pt)
	{
		if ((x < 215) & (y < 295))
		{
	 	LCD_WriteChinese24x24(x, y, CharColor, CharBackColor, pt);
		if (*pt == ' ')
		{
			pt += 1 ;
		}
		else
		{
			pt += 2 ;
		}
		}
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)  
    if (x<215)
    {
      x += 24;
    } 
    else if (y < 295)
    {
      x = 0;
      y += 24;
    }   
    else
    {
      x = 0;
      y = 0;
    }     
#else
    if (y < 295)
    {
      y += 24;
    }
    else if (x < 215)
    {
      y = 0;
      x += 24;
    }
    else
    {
      x = 0;
      y = 0;
    }
#endif

	}
}

//-----------------------------------------------------------------
//	void LCD_WriteNumChar (
//		u8 x,
//		u16  y,
//		u16 CharColor,
//		u16 CharBackColor,
//		u8 udata
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD显示字符数值
// 入口参数: x: 横向坐标, 由左到右分别是0~239. 
//					 y: 纵向坐标, 由上到下分别为0~319.
//				 CharColor: 字符的颜色,
//				CharBackColor: 字符背景颜色.
//         	 udata: 字符数值.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_WriteString().   
// 注意事项: (1) 显示的值为0~255之间
//				 	 (2) 数据显示格式: 右对齐
//-----------------------------------------------------------------
void LCD_WriteNumChar (
		u8 x,
		u16  y,
		u16 CharColor,
		u16 CharBackColor,
		u8 udata
	)
{
	u8 temp[4];
	u8 i;
	for (i = 3; i > 0; i --)
	{
		if (udata != 0)
		{
			temp[i - 1] = (udata % 10) + 48;
			udata /= 10;
		}
		else
		{
			if(i!=3)
				temp[i - 1] = ' ';									// 高位显示空格
			else
				temp[2] = '0';											// 显示0
		}
	}
	temp[3] = '\0';
	LCD_WriteString (x, y, CharColor, CharBackColor, temp);
}

//-----------------------------------------------------------------
//	void LCD_WriteNumInt (
//		u8 x,
//		u16  y,
//		u16 CharColor,
//		u16 CharBackColor,
//		u16 udata
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD显示整形数值
// 入口参数: x: 横向坐标, 由左到右分别是0~239. 
//					 y: 纵向坐标, 由上到下分别为0~319.
//				 CharColor: 字符的颜色, 
// 			CharBackColor: 字符背景颜色.
//         	 udata: 整形数据数值.
// 返回参数: 无 
// 全局变量: 无
// 调用模块: LCD_WriteString().   
// 注意事项: (1) 显示的值为0~65535之间
//				 	 (2) 数据显示格式: 右对齐
//-----------------------------------------------------------------
void LCD_WriteNumInt (
		u8 x,
		u16  y,
		u16 CharColor,
		u16 CharBackColor,
		u16 udata
	)
{
	u8 temp[6];
	u8 i;
	for (i = 5; i > 0; i --)
	{
		if (udata != 0)
		{
			temp[i - 1] = (udata % 10) + 48;
			udata /= 10;
		}
		else
		{
			if(i!=5)
				temp[i - 1] = ' ';									// 高位显示空格
			else
				temp[4] = '0';											// 显示0
		}
	}
	temp[5] = '\0';
	LCD_WriteString (x, y, CharColor, CharBackColor, temp);
}

//-----------------------------------------------------------------
//	void LCD_WriteNumInt (
//		u8 x,
//		u16  y,
//		u16 CharColor,
//		u16 CharBackColor,
//		unsigned long udata
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD显示整形数值
// 入口参数: x: 横向坐标, 由左到右分别是0~239. 
//					 y: 纵向坐标, 由上到下分别为0~319.
//				 CharColor: 字符的颜色, 
//				CharBackColor: 字符背景颜色.
//         	 udata: 长整形数据数值.
// 返回参数: 无 
// 全局变量: 无
// 调用模块: LCD_WriteString().   
// 注意事项: (1) 显示的值为0~4294967296之间
//				   (2) 数据显示格式: 右对齐
//-----------------------------------------------------------------
void LCD_WriteNumLong (
		u8 x,
		u16  y,
		u16 CharColor,
		u16 CharBackColor,
		unsigned long udata
	)
{
	u8 temp[11];
	u8 i;
	for (i = 10; i > 0; i --)
	{
		if (udata != 0)
		{
			temp[i - 1] = (udata % 10) + 48;
			udata /= 10;
		}
		else
		{
			if(i!=10)
				temp[i - 1] = ' ';									// 高位显示空格
			else
				temp[9] = '0';											// 显示0
		}
	}
	temp[10] = '\0';
	LCD_WriteString (x, y, CharColor, CharBackColor, temp);
}

//-----------------------------------------------------------------
// 图形显示区域
//-----------------------------------------------------------------

//-----------------------------------------------------------------
//	void LCD_SetBox(
//	   u8 xStart,														// x方向起始点
//	   u16  yStart,													// y方向起始点
//	   u8 xStop,						  						  // x方向终止点
//	   u16  yStop						   							// y方向终止点
//	)
//-----------------------------------------------------------------
//
// 函数功能: LCD块选函数, 选定LCD上指定的矩形区域.
// 入口参数: xStart: x方向的起始点, ySrart: y方向的终止点
//         	 xStop:  x方向终止点,   yStop:  y方向终止点
// 返回参数: 无
// 全局变量: 无
// 调用模块: SPFD5408_Set_Cursor(), SPFD5408_Write_Reg().   
// 注意事项: xStart和 yStart随着屏幕的旋转而改变，位置是矩形框的四个角
//-----------------------------------------------------------------
void LCD_SetBox(
   u8 xStart,                								// x方向起始点
   u16  yStart,															// y方向起始点
   u8 xStop,							   								// x方向终止点
   u16  yStop							   								// y方向终止点
)
{
	u8 xLong;
	u16  yLong;

	xLong = xStop - xStart ;
	yLong = yStop - yStart ;
  
#if ID_AM==000    
	SPFD5408_Set_Cursor (xStart + xLong - 1, yStart + yLong - 1);
#elif ID_AM==001
	SPFD5408_Set_Cursor (xStart + xLong - 1, yStart + yLong - 1);
#elif ID_AM==010
	SPFD5408_Set_Cursor (xStart, yStart + yLong - 1);
#elif ID_AM==011 
	SPFD5408_Set_Cursor (xStart, yStart + yLong - 1);
#elif ID_AM==100
	SPFD5408_Set_Cursor (xStart + xLong - 1, yStart);     
#elif ID_AM==101
	SPFD5408_Set_Cursor (xStart + xLong - 1, yStart);     
#elif ID_AM==110
	SPFD5408_Set_Cursor (xStart, yStart); 
#elif ID_AM==111
	SPFD5408_Set_Cursor (xStart, yStart);  
#endif     
	SPFD5408_Write_Reg (0x0050, xStart);						// 水平 GRAM起始位置
	SPFD5408_Write_Reg (0x0051, xStart + xLong - 1);// 水平GRAM终止位置
	SPFD5408_Write_Reg (0x0052, yStart);						// 垂直GRAM起始位置
	SPFD5408_Write_Reg (0x0053, yStart + yLong - 1);// 垂直GRAM终止位置 
}
 
//-----------------------------------------------------------------
//	void LCD_ColorBox(
//		u8 xStart,                       			// x方向的起始点
//		u16  yStart,													// y方向的起始点
//		u8 xStop,															// x方向的终止点
//		u16  yStop,														// y方向的终止点
//		u16 Color						    							// 填充颜色
//	)
//-----------------------------------------------------------------
//
// 函数功能: 向矩形区域填充颜色
// 入口参数: xStart: x方向的起始点, ySrart: y方向的终止点
//         	 xStop:  x方向终止点,   yStop:  y方向终止点
//				 Color: 填充颜色
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_SetBox(), SPFD5408_WR_Start(), SPFD5408_Write_Data().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_ColorBox(
	u8 xStart,                 								// x方向的起始点
	u16  yStart,															// y方向的起始点
	u8 xStop,																	// x方向的终止点
	u16  yStop,																// y方向的终止点
	u16 Color						    									// 填充颜色
)
{
	u8 xLong;																	// 矩形x方向长度
	u16  yLong;						    								// 矩形y方向长度
	unsigned long temp;

