Wendellee/2024-Electronics-Competition/module_doc/MAX262_V1.1模块资料/MAX262_V1.1模块资料/参考测试程序/STM32F1控制程序/MAX262_STM32_LCD_PWM波/User/SPFD5408.c
	xLong = xStop - xStart;
	yLong = yStop - yStart;
  
	LCD_SetBox (xStart, yStart, xStop + 1, yStop + 1);
	SPFD5408_WR_Start ();
	SPFD5408_RS_Set;
  
	for (temp = 0; temp < (xLong + 1) * (yLong + 1); temp ++)
		SPFD5408_Write_Data (Color);						

	SPFD5408_CS_Set;
}

//-----------------------------------------------------------------
//	void LCD_ClearCharBox(
//		u8 x,																	// 横坐标
//		u16  y,							 									// 纵坐标
//		u16 Color															// 写入的颜色
//	)
//-----------------------------------------------------------------
//
// 函数功能: 将指定区域擦为指定颜色
// 入口参数: x: x方向的起始点, 
//					 y: y方向的起始点,
//           color: 指定LCD全屏颜色 RGB(5-6-5).
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_SetBox(), SPFD5408_WR_Start(), SPFD5408_Write_Data().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_ClearCharBox(
	u8 x,																			// 横坐标
	u16  y,							 											// 纵坐标
	u16 Color																	// 写入的颜色
)
{
	unsigned long temp;
  
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)
	LCD_SetBox (x, y, x + 8, y + 16);    
#else
	LCD_SetBox(x,y,x + 16, y + 8);    
#endif 
	SPFD5408_WR_Start();
	SPFD5408_RS_Set;
	for (temp=0; temp < 128; temp++)
	{
		SPFD5408_Write_Data(Color);  
	}	
	SPFD5408_CS_Set;
}

//-----------------------------------------------------------------
// void LCD_SetPoint(u8 x, u16 y, u16 Color)
//-----------------------------------------------------------------
//
// 函数功能: 用指定的颜色在指定的坐标位置上画出一个点
// 入口参数: x: 横向坐标, 由左到右分别是0~239. 
//					 y: 纵向坐标, 由上到下分别为0~319.
//	         Color: 描点的颜色.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_ColorBox().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_SetPoint(u8 x, u16 y, u16 Color)
{  
	LCD_ColorBox (x, y, x, y, Color);					// 可以设定一个点的大小
	//SPFD5408_Read_Pixel(X,Y,Color);
}

//-----------------------------------------------------------------
// void LCD_HLine(u8 x, u16 y, u16 Length, u16 Color)
//-----------------------------------------------------------------
//
// 函数功能: 用指定的颜色在指定位置上画出指定长度的一条横线 
// 入口参数: x: 横向起点坐标, 由左到右分别是0~239. 
//					 y: 纵向起点坐标, 由上到下分别为0~319.
//				 	Length: 画线长度. Color: 描点的颜色.
// 返回参数: 无 
// 全局变量: 无
// 调用模块: LCD_SetBox(),SPFD5408_WR_Start(),SPFD5408_Write_Data(). 
// 注意事项:
//-----------------------------------------------------------------
void LCD_HLine(u8 x, u16 y, u16 Length, u16 Color) 
{  																					// 判断屏幕方向
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	
	LCD_SetBox(x, y, x + Length + 1, y + 1);	// 设置窗口
#else
	LCD_SetBox(x, y, x + 1, y + Length + 1);
#endif 
	SPFD5408_WR_Start();											// 启动写数据
 	do
	{  
		SPFD5408_Write_Data(Color);							// 写入颜色数据						
		Length--;
	}while(Length);
	SPFD5408_CS_Set;													// 取消片选
}

//-----------------------------------------------------------------
//	void LCD_HDotLine(
//		u8 x, 																// x 起始坐标
//		u16 y, 																// y 起始坐标
//		u16 Length, 													// 长度
//		u16 Color,														// 线颜色
//		u16 CharBackColor											// 背景颜色
//	) 
//-----------------------------------------------------------------
//
// 函数功能: 用指定的颜色在指定位置上画出指定长度的一条横虚线
// 入口参数: x: 横向起点坐标, 由左到右分别是0~239. 
//					 y: 纵向起点坐标, 由上到下分别为0~319.
//				 Length: 画线长度.
//					Color: 描点的颜色.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_SetBox(), SPFD5408_WR_Start(), SPFD5408_Write_Data().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_HDotLine(
		u8 x, 																	// x 起始坐标
		u16 y, 																	// y 起始坐标
		u16 Length, 														// 长度
		u16 Color,															// 线颜色
		u16 CharBackColor												// 背景颜色
	) 
{  																					// 判断屏幕方向
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	
	LCD_SetBox(x, y, x + Length + 1, y + 1);	// 设置窗口
#else
	LCD_SetBox(x, y, x + 1, y + Length + 1);
#endif 
	SPFD5408_WR_Start();											// 启动写数据
	do
	{ 
		if ((Length % DOT) == 0)								// 间隔DOT点画虚线
		{
			SPFD5408_Write_Data(Color);						// 写入线颜色
		} 
		else																		// 其它点
		{
			SPFD5408_Write_Data(CharBackColor);		// 写入背景颜色	
		}
		Length--;
	}while(Length);
	SPFD5408_CS_Set;												 	// 取消片选
}

//-----------------------------------------------------------------
//	void LCD_RLine(
//		u8 x, 
//		u16  y, 
//		u16  High, 
//		u16 Color
//	) 
//-----------------------------------------------------------------
//
// 函数功能: 用指定的颜色在指定位置上画出指定长度的一条竖线
// 入口参数: x: 横向起点坐标, 由左到右分别是0~239.
//					 y: 纵向起点坐标, 由上到下分别为0~319.
//			    High: 画线长度. 
//				 Color: 描点的颜色.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_SetBox(), SPFD5408_WR_Start(),SPFD5408_Write_Data().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_RLine(
		u8 x,																		// x轴坐标 
		u16  y, 																// y轴坐标
		u16  High, 															// 线高度
		u16 Color																// 线颜色
	) 
{  																					// 判断屏幕显示方向
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	
	LCD_SetBox(x, y, x + 1, y + High + 1);		// 设置窗口
#else
	LCD_SetBox(x, y, x + High + 1, y + 1);
#endif 
	SPFD5408_WR_Start();											// 启动写数据
	do
	{  
		SPFD5408_Write_Data(Color);							// 写入颜色数据
		High--;
	}while(High);
	SPFD5408_CS_Set;													// 取消片选
}

//-----------------------------------------------------------------
//	void LCD_RDotLine(
//		u8 x, 																// x 起始坐标
//		u16 y, 																// y 起始坐标
//		u16 High, 														// 线高度
//		u16 Color,														// 线颜色
//		u16 CharBackColor											// 背景颜色
//	)
//-----------------------------------------------------------------
//
// 函数功能: 用指定的颜色在指定位置上画出指定长度的一条竖虚线
// 入口参数: x： 横向起点坐标, 由左到右分别是0~239. 
//					 y: 纵向起点坐标, 由上到下分别为0~319.
//			    High: 画线长度. 
//				 Color: 描点的颜色. 
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_SetBox(),SPFD5408_WR_Start(),SPFD5408_Write_Data().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_RDotLine(
		u8 x, 																	// x 起始坐标
		u16 y, 																	// y 起始坐标
		u16 High, 															// 线高度
		u16 Color,															// 线颜色
		u16 CharBackColor												// 背景颜色
	) 
{  																					// 判断屏幕显示方向
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	
	LCD_SetBox(x, y, x + 1, y + High + 1);		// 设置窗口
#else
	LCD_SetBox(x, y, x + High + 1, y + 1);
#endif 
	SPFD5408_WR_Start();											// 启动写数据
	do
	{  
		if ((High % DOT) == 0)									// 间隔DOT点画虚线
		{
			SPFD5408_Write_Data(Color);						// 写入线颜色
		}
		else 																		// 其它点
		{
			SPFD5408_Write_Data(CharBackColor);		// 写入背景颜色	
		}
		High--;
	}while(High);
	SPFD5408_CS_Set;													// 取消片选
}

//-----------------------------------------------------------------
//	void LCD_Print_Box(
//		u16 x0,																// 左上角起始x轴坐标
//		u16 y0,																// 左上角起始y轴坐标
//		u16 x1,																// 右下角终止x轴坐标
//		u16 y1,																// 右下角终止y轴坐标
//		u16 Color															// 矩形框颜色
//	)
//-----------------------------------------------------------------
//
// 函数功能: 画方框函数
// 入口参数: x0: 左上角x起始坐标. y0: 左上角y起始坐标.
//				 x1: 右下角x终止坐标. y1: 右下角y终止坐标.
//				 Color: 方框的原色值.
// 返回参数: 无
// 全局变量: 无
// 调用模块: LCD_RLine(), LCD_HLine().   
// 注意事项:
//-----------------------------------------------------------------
void LCD_Print_Box(
		u16 x0,
		u16 y0,
		u16 x1,
		u16 y1,
		u16 Color
	)
{
	u16 High;
	u16 Length;
																						// 竖屏
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	  
	High   = y1 - y0;
	Length = x1 - x0;
	LCD_RLine (x0, y0, High + 1, Color) ; 		// 竖线
	LCD_RLine (x1, y0, High + 1, Color) ;
	LCD_HLine (x0, y0, Length + 1, Color) ;		// 横线
	LCD_HLine (x0, y1, Length + 1, Color) ;
#else																				// 横屏
	High   = x1 - x0;
	Length = y1 - y0;
	LCD_RLine (x0, y0, High, Color); 					// 竖线
	LCD_RLine (x0, y1, High, Color);
	LCD_HLine (x0, y0, Length + 1, Color);		// 横线
	LCD_HLine (x1, y0, Length + 1, Color);
#endif 
}


//-----------------------------------------------------------------
// 图片显示区域
//-----------------------------------------------------------------

//-----------------------------------------------------------------
//	void LCD_DisPicture(
//		u8 x,																	// 显示起始X坐标 
//		u16 y, 																// 显示起始y坐标
//		u8 length, 														// 图片长度
//		u16 high, 														// 图片高度
//		u8 *s																	// 指向图片数据指针
//	)
//-----------------------------------------------------------------
//
// 函数功能: 用指定位置上显示事先定义的图片
// 入口参数: (x, y): 是开始点的坐标. 
//					 length: 图片长度. 
//						 high: 图片高度. 
//							 *S: 图片数组的指针 
// 返回参数: 无 
// 全局变量: 无
// 调用模块: LCD_SetBox(), SPFD5408_WR_Start(), SPFD5408_Write_Data().    
// 注意事项: 将要显示的图片事先定义在bmp.h中的pic[]数组中,
//				 如果想修改图片大小、内容，请修改bmp.h中的pic[]数组,
//				 建议用Image2Lcd软件将你要显示的图象自动转换为数组数据.
//-----------------------------------------------------------------
void LCD_DisPicture(
		u8 x,																		// 显示起始X坐标 
		u16 y, 																	// 显示起始y坐标
		u8 length, 															// 图片长度
		u16 high, 															// 图片高度
		u8 *s																		// 指向图片数据指针
	)
{
   u16 temp = 0 ;
	u16 tmp  = 0 ;
	u16 num  = 0 ;	
																						// 判断屏幕显示方向
#if (ID_AM==000)|(ID_AM==010)|(ID_AM==100)|(ID_AM==110)	
	LCD_SetBox (x, y, x + length, y + high) ; // 设置窗口
#else
	LCD_SetBox(x, y, x + high, y + length);    
#endif 
	SPFD5408_WR_Start();											// 启动写数据
	num = length * high * 2 ;									// 计算写入数据个数
	do
	{  
	   temp = s[tmp + 1] ;										// 读取高8位数据
	   temp = temp << 8 ;											// 读取低8位数据
	   temp = temp | s[tmp] ;									// 将数据组合成一个16位的数据
	   SPFD5408_Write_Data (temp) ;						// 逐点显示
	   tmp += 2 ;															// 继续读取后两个数据
	}while (tmp < num) ;
	SPFD5408_CS_Set;													// 取消片选
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
